<?php


/*----------------------------------------Обработка полей ввода-------------------------------------------------------*/

$name = $_POST['name'];
$multiline = $_POST['multiline'];
$name = htmlspecialchars($name);
$multiline = htmlspecialchars($multiline);

/*----------------------------------------Обработка радио кнопок------------------------------------------------------*/

$contact = $_POST['contact']; //Результат радиокнопки. Сюда запишется результат выбора. Либо телефон либо почта

/*----------------------------------------Обработка флажков-----------------------------------------------------------*/

$flags = $_POST['formDoor'];
if(empty($flags))
{
    echo("Вы ничего не выбрали.");
}
else
{
    $N = count($flags);
    echo("Выбрано заданий: $N. ");
    for($i=0; $i < $N; $i++)
    {
        echo($flags[$i] . ", ");
    }
}


/*----------------------------------------Отправляем письмо на почту--------------------------------------------------*/

if (mail("LialinAleksey08kk@yandex.ru", "Письмо с формы", "$name, $multiline, $contact", "Form: no-reply@mydomain.ru \r\n")) {
    echo('Данные успешно отправлены!');
} else {
    echo('Где то ошибка...');
}
