<?php

/*----------------------------------------Обработка полей ввода-------------------------------------------------------*/

$name = $_POST['name'];
$multiline = $_POST['multiline'];
$name = htmlspecialchars($name);
$multiline = htmlspecialchars($multiline);

/*----------------------------------------Обработка радио кнопок------------------------------------------------------*/

$radio = $_POST['radio']; //Результат радиокнопки. Сюда запишется результат выбора.

/*----------------------------------------Обработка флажков-----------------------------------------------------------*/
$flags = $_POST['flag'];
$select = 0;
if (empty($flags)) {
    echo("Вы ничего не выбрали.");
} else {
    foreach($flags as $selectedFlags){
    $select = $selectedFlags . ', ';
 //       echo ($select);
    }
}
/*----------------------------------------Обработка выпадающего списка------------------------------------------------*/

$country = $_POST['country'];

/*----------------------------------------Отправляем письмо на почту--------------------------------------------------*/

if (mail("lialinaleksey08kk@yandex.ru", "Письмо с формы",
    "$name, $multiline, $radio, $select,$country",
    "Form: no-reply@mydomain.ru \r\n")) {
    echo('Данные успешно отправлены!');
} else {
    echo('Где то ошибка...');
}
